tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "shopify/shopify"
tap "stripe/stripe-cli"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Command-line tool to interact with exercism.io
brew "exercism"
# Platform built on V8 to build network applications
brew "node"
# Firebase command-line tools
brew "firebase-cli"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Command-line interface for SQLite
brew "sqlite"
# Core application library for C
brew "glib"
# LLVM's OpenMP runtime library
brew "libomp"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# X.509 and CMS library
brew "libksba"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# GUI for vim, made for macOS
brew "macvim"
# Cross platform, open source .NET development framework
brew "mono"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Object-relational database system
brew "postgresql", restart_service: true
# Object-relational database system
brew "postgresql@12"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Google's open source JavaScript engine
brew "v8@3.15"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Shopify CLI helps you build Shopify apps faster. It quickly scaffolds Node.js
# and Ruby on Rails embedded apps. It also automates many common tasks in the
# development process and lets you quickly add popular features, such as billing
# and webhooks.
brew "shopify/shopify/shopify-cli"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# GPU-accelerated terminal emulator
cask "alacritty"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
cask "font-hack-nerd-font"
